In [1]:
import pandas as pd

In [2]:
newdict = {"datatype":["int","char","float","double"],"size":[4,1,4,8]}

In [3]:
df = pd.DataFrame(newdict)

In [4]:
df

  datatype  size
0      int     4
1     char     1
2    float     4
3   double     8

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df["datatype"]

0       int
1      char
2     float
3    double
Name: datatype, dtype: object

In [7]:
df["size"]

0    4
1    1
2    4
3    8
Name: size, dtype: int64

In [8]:
df.loc[2]

datatype    float
size            4
Name: 2, dtype: object

In [10]:
df.index = ["i","ii","iii","iv"]

In [11]:
df

    datatype  size
i        int     4
ii      char     1
iii    float     4
iv    double     8

In [12]:
df.loc["iii"]

datatype    float
size            4
Name: iii, dtype: object

In [13]:
df.iloc[2]

datatype    float
size            4
Name: iii, dtype: object

In [21]:
l = [[1,2,3],[9,8,7],[4,5,6]]

In [22]:
df2 = pd.DataFrame(l,columns = ["X","Y","Z"],index = ["I","II","III"])

In [23]:
df2

     X  Y  Z
I    1  2  3
II   9  8  7
III  4  5  6

In [25]:
df3 = pd.DataFrame()

###

In [26]:
df3

Empty DataFrame
Columns: []
Index: []

In [27]:
df3["A"] = [100,125,67,78]

In [28]:
df3["B"] = [35,76,98,21]

In [29]:
df3

     A   B
0  100  35
1  125  76
2   67  98
3   78  21

In [30]:
df3.loc[2]=[56,72]

In [31]:
df3

     A   B
0  100  35
1  125  76
2   56  72
3   78  21

In [32]:
df3.drop("A",axis=1,inplace=True)

In [33]:
df3

    B
0  35
1  76
2  72
3  21

In [34]:
df2

     X  Y  Z
I    1  2  3
II   9  8  7
III  4  5  6

In [35]:
df2.to_dict()

{'X': {'I': 1, 'II': 9, 'III': 4},
 'Y': {'I': 2, 'II': 8, 'III': 5},
 'Z': {'I': 3, 'II': 7, 'III': 6}}

In [37]:
df.sort_values("size")

    datatype  size
ii      char     1
i        int     4
iii    float     4
iv    double     8

In [38]:
df.reset_index()

  index datatype  size
0     i      int     4
1    ii     char     1
2   iii    float     4
3    iv   double     8